(TeX-add-style-hook "packages"
 (lambda ()
    (TeX-run-style-hooks
     "bibentry"
     "hypernat"
     "natbib"
     "numbers"
     "sort&compress"
     "square"
     "super"
     "xetex"
     "calc"
     "listings"
     "setspace"
     "ccaption"
     "subfigure"
     "rotating"
     "placeins"
     "below"
     "xcolor"
     "x11names"
     "graphicx"
     "siunitx"
     "tabularx"
     "diagbox"
     "multirow"
     "booktabs"
     "type1cm"
     "ntheorem"
     "amsmath"
     "thmmarks"
     "hyperref"
     "fancyvrb"
     "enumitem"
     "shortlabels"
     "paralist"
     "layouts"
     "footmisc"
     "perpage"
     "symbol"
     "fancyhdr"
     "titletoc"
     "titlesec"
     "sf"
     "indentfirst"
     "geometry"
     "22.2cm}")))

